tutorials/lagrangian/coalChemistryFoam/simplifiedSiwek/constant/sourcesProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      sourcesProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

source1
{
    type            scalarExplicitSource;
    active          true;
    timeStart       0.15;
    duration        0.2;
    selectionMode   cellSet;
    cellSet         ignitionCells;

    scalarExplicitSourceCoeffs
    {
        volumeMode      absolute;
        injectionRate
        {
            hs              20000;
        }
    }
}


// ************************************************************************* //
